// // Задача 19

// System.Console.WriteLine("Введите пятизначное число: ");
// string? num = Console.ReadLine();

// if (num[0]==num[4] && num[1] == num[3]) 
// {
//     System.Console.WriteLine("Число является палиндромом ");
// }
// else 
// {
//     System.Console.WriteLine("Число не является палиндромом");
// }


// // int convertedNum = Convert.ToInt32(Convert.ToString(num[2]));
// // System.Console.WriteLine(convertedNum);


// Задача 24: Напишите прграмму, которая принимает на вход число и выдает сумму числе от 1 до А

// int GetNumber(string text)
// {
//     System.Console.Write(text);
//     return Convert.ToInt32(Console.ReadLine());
// }

// int GetSumElements(int A)
// {
//     int result = 0;
//     for (int i = 1; i <= A; i++)
//     {
//         result += i;
//     }
//     return result;
// }

// int num = GetNumber("Введите число А: ");
// System.Console.WriteLine($"Сумма чисел от 1 до {num} = {GetSumElements(num)}");

